import "dotenv/config";
import express from "express";
import fs from "fs";
import mysql from "mysql2";
import { body } from "express-validator";
import rateLimit from "express-rate-limit";
import http from "http";
import { fileURLToPath } from "url";
import { dirname } from "path";

import moment from "moment-jalaali";
import bcrypt from "bcrypt";
import crypto from "crypto";
import jwt from "jsonwebtoken";
import nodemailer from "nodemailer";
import cookieParser from "cookie-parser";
import cookie from "cookie";
const __dirname = dirname(fileURLToPath(import.meta.url));

const globalPass = process.env.GLOBAL_PASS;
const globalKeys = [process.env.GLOBAL_KEY1, process.env.GLOBAL_KEY2];

const { dbhost, dbuser, dbdatabase, dbpassword } = process.env;

const hostDatabase = {
  host: dbhost,
  user: dbuser,
  database: dbdatabase,
  password: dbpassword,
};

const settings = (app) => {
  app.set("trust proxy", 1);
  app.use((req, res, next) => {
    res.setHeader(
      "Cache-Control",
      "no-store, no-cache, must-revalidate, private"
    );
    res.setHeader("Pragma", "no-cache");
    res.setHeader("Expires", "0");
    next();
  });
  // express
  app.use(express.static("public"));
  app.use(express.json());

  // cookie
  app.use(cookieParser());

  app.use(express.urlencoded({ extended: true }));

  // const limiter = rateLimit({
  //   windowMs: 4 * 1000,
  //   max: 5,
  //   message: "لطفا چند ثانیه دیگر تلاش کنید.",
  // });

  // app.use(limiter);
};
let faDate = {
  days: {
    1: "یک",
    2: "دو",
    3: "سه",
    4: "چهار",
    5: "پنج",
    6: "شش",
    7: "هفت",
    8: "هشت",
    9: "نه",
    10: "ده",
    11: "یازده",
    12: "دوازده",
    13: "سیزده",
    14: "چهارده",
    15: "پانزده",
    16: "شانزده",
    17: "هفده",
    18: "هجده",
    19: "نوزده",
    20: "بیست",
    21: "بیست و یک",
    22: "بیست و دو",
    23: "بیست و سه",
    24: "بیست و چهار",
    25: "بیست و پنج",
    26: "بیست و شش",
    27: "بیست و هفت",
    28: "بیست و هشت",
    29: "بیست و نه",
    30: "سی",
    31: "سی و یک",
  },
};
const books = {
  اول: [
    "فارسی",
    "ریاضی",
    "علوم تجربی",
    "قرآن",
    "هدیه‌های آسمان",
    "کتاب نگارش فارسی",
    "آموزش قرآن",
  ],

  دوم: [
    "فارسی",
    "ریاضی",
    "علوم تجربی",
    "قرآن",
    "هدیه‌های آسمان",
    "کتاب نگارش فارسی",
    "آموزش قرآن",
  ],

  سوم: [
    "فارسی",
    "ریاضی",
    "علوم تجربی",
    "قرآن",
    "هدیه‌های آسمان",
    "کتاب نگارش فارسی",
    "آموزش قرآن",
  ],

  چهارم: [
    "فارسی",
    "ریاضی",
    "علوم تجربی",
    "مطالعات اجتماعی",
    "هدیه‌های آسمان",
    "قرآن",
    "نگارش فارسی",
    "آموزش قرآن",
  ],

  پنجم: [
    "فارسی",
    "ریاضی",
    "علوم تجربی",
    "مطالعات اجتماعی",
    "هدیه‌های آسمان",
    "قرآن",
    "نگارش فارسی",
    "آموزش قرآن",
  ],
  ششم: [
    "فارسی",
    "ریاضی",
    "علوم تجربی",
    "مطالعات اجتماعی",
    "هدیه‌های آسمان",
    "قرآن",
    "نگارش فارسی",
    "آموزش قرآن",
    "کار و فناوری",
    "تفکر و پژوهش",
  ],
  هفتم: [
    "فارسی",
    "نگارش",
    "عربی",
    "انگلیسی",
    "ریاضی",
    "علوم تجربی",
    "مطالعات اجتماعی",
    "هدیه‌های آسمان",
    "قرآن",
    "تفکر و سبک زندگی",
    "کار و فناوری",
    "فرهنگ و هنر",
  ],
  هشتم: [
    "فارسی",
    "نگارش",
    "عربی",
    "انگلیسی",
    "ریاضی",
    "علوم تجربی",
    "مطالعات اجتماعی",
    "هدیه‌های آسمان",
    "قرآن",
    "تفکر و سبک زندگی",
    "کار و فناوری",
    "فرهنگ و هنر",
  ],
  نهم: [
    "فارسی",
    "نگارش",
    "عربی",
    "انگلیسی",
    "ریاضی",
    "علوم تجربی",
    "مطالعات اجتماعی",
    "هدیه‌های آسمان",
    "قرآن",
    "کار و فناوری",
    "فرهنگ و هنر",
  ],
  دهم: {
    "ریاضی فیزیک": [
      "فارسی",
      "نگارش",
      "عربی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی 1",
      "فیزیک 1",
      "شیمی 1",
      "هندسه 1",
      "علوم و فنون ادبی 1",
      "تفکر و سواد رسانه‌ای",
      "آمادگی دفاعی",
    ],
    تجربی: [
      "فارسی",
      "نگارش",
      "عربی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی 1",
      "فیزیک 1",
      "شیمی 1",
      "زیست‌شناسی 1",
      "علوم و فنون ادبی 1",
      "تفکر و سواد رسانه‌ای",
      "آمادگی دفاعی",
    ],
    انسانی: [
      "فارسی",
      "نگارش",
      "عربی تخصصی",
      "زبان انگلیسی",
      "دین و زندگی",
      "منطق",
      "ریاضی و آمار 1",
      "اقتصاد",
      "تاریخ 1",
      "جغرافیا 1",
      "علوم و فنون ادبی 1",
      "آمادگی دفاعی",
    ],
  },
  یازدهم: {
    "ریاضی فیزیک": [
      "فارسی",
      "نگارش",
      "عربی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی 2",
      "فیزیک 2",
      "شیمی 2",
      "هندسه 2",
      "آمار و احتمال",
      "علوم و فنون ادبی 2",
    ],
    تجربی: [
      "فارسی",
      "نگارش",
      "عربی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی 2",
      "فیزیک 2",
      "شیمی 2",
      "زیست‌شناسی 2",
      "علوم و فنون ادبی 2",
    ],
    انسانی: [
      "فارسی",
      "نگارش",
      "عربی تخصصی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی و آمار 2",
      "جامعه‌شناسی 1",
      "تاریخ 2",
      "جغرافیا 2",
      "فلسفه",
      "علوم و فنون ادبی 2",
    ],
  },
  دوازدهم: {
    "ریاضی فیزیک": [
      "فارسی",
      "نگارش",
      "عربی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی 3",
      "فیزیک 3",
      "شیمی 3",
      "هندسه 3",
      "گسسته",
      "علوم و فنون ادبی 3",
    ],
    تجربی: [
      "فارسی",
      "نگارش",
      "عربی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی 3",
      "فیزیک 3",
      "شیمی 3",
      "زیست‌شناسی 3",
      "علوم و فنون ادبی 3",
    ],
    انسانی: [
      "فارسی",
      "نگارش",
      "عربی تخصصی",
      "زبان انگلیسی",
      "دین و زندگی",
      "ریاضی و آمار 3",
      "جامعه‌شناسی 2",
      "تاریخ 3",
      "جغرافیا 3",
      "فلسفه 2",
      "علوم و فنون ادبی 3",
    ],
  },
};

export {
  mysql,
  bcrypt,
  jwt,
  nodemailer,
  faDate,
  cookie,
  crypto,
  fs,
  http,
  __dirname,
  globalPass,
  globalKeys,
  hostDatabase,
  books,
  body,
  rateLimit,
  moment,
  express,
  cookieParser,
  settings,
};
